In [12]:
import pandas as pd
from sklearn.preprocessing import LabelBinarizer

# Data reading in and wrangling

Here we read in the data and get it in the shape we want. We fill in the age with the median value with the *test['Age'].fillna((test['Age'].mean()), inplace=True)* command and the we one hot encode the sex and Pclass with sklearn's

In [22]:
def readInData():
    test, train = pd.read_csv('titanic/test.csv'), pd.read_csv('titanic/train.csv')
    # Fill age with mean
    test['Age'].fillna((test['Age'].mean()), inplace=True)
    train['Age'].fillna((train['Age'].mean()), inplace=True)
    
    # One hot encode Pclass
    y = LabelBinarizer().fit_transform(train.Pclass)
    train = pd.concat([train, pd.DataFrame(y)], axis=1)
    
    # One hot encode Pclass
    y = LabelBinarizer().fit_transform(test.Pclass)
    test = pd.concat([test, pd.DataFrame(y)], axis=1)
    
    # One hot encode Sex
    y = LabelBinarizer().fit_transform(train.Sex)
    train = pd.concat([train, pd.DataFrame(y)], axis=1)
    
    # One hot encode Sex
    y = LabelBinarizer().fit_transform(test.Sex)
    test = pd.concat([test, pd.DataFrame(y)], axis=1)
    
    train = train.drop(['PassengerId', 'Name', 'Ticket', 'Cabin', 'Embarked', 'Pclass', 'Sex'], axis=1)
    test = test.drop(['PassengerId', 'Name', 'Ticket', 'Cabin', 'Embarked', 'Pclass', 'Sex'], axis=1)
    
    
    return test, train
#df, df1 = readInData()
readInData()[0]

          Age  SibSp  Parch      Fare  0  1  2  0
0    34.50000      0      0    7.8292  0  0  1  1
1    47.00000      1      0    7.0000  0  0  1  0
2    62.00000      0      0    9.6875  0  1  0  1
3    27.00000      0      0    8.6625  0  0  1  1
4    22.00000      1      1   12.2875  0  0  1  0
..        ...    ...    ...       ... .. .. .. ..
413  30.27259      0      0    8.0500  0  0  1  1
414  39.00000      0      0  108.9000  1  0  0  0
415  38.50000      0      0    7.2500  0  0  1  1
416  30.27259      0      0    8.0500  0  0  1  1
417  30.27259      1      1   22.3583  0  0  1  1

[418 rows x 8 columns]

In [11]:
df

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.50000,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.00000,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.00000,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.00000,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.00000,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,30.27259,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.00000,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.50000,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,30.27259,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,30.27259,1,1,2668,22.3583,NaN,C